#!/usr/bin/env bash

emojis=("⊂(◉‿◉)つ" "(ㆆ _ ㆆ)" "☜(꒡⌓꒡)" "ᕕ( ᐛ )ᕗ" "(ง •̀_•́)ง" "(•̀ᴗ•́)و ̑̑" "(ง'̀-'́)ง" "(ง •̀_•́)ง" 
  "	¯\_(ツ)_/¯" "✿ڿڰۣ—" "ヽ༼ຈʖ̯ຈ༽ﾉ" "( ͡° ʖ̯ ͡°)" "ε(\´סּ︵סּ\`)з" "(╯°□°)╯" "(•ᴥ• )́\`́\'́\`́'́⻍" "(☞ﾟヮﾟ)☞"
  "( •_•)O*¯\`·.¸.·\´¯\`°Q(•_• )" "┌(◉ ͜ʖ◉)つ┣▇▇▇═──" "༼ ༎ຶ ෴ ༎ຶ༽" "(/¯◡ ‿ ◡)/¯ ~ ┻━┻" "ᕦ(⩾﹏⩽)ᕥ"
  "	L(° O °L)" "	╰( ͡° ͜ʖ ͡° )つ──☆*:・ﾟ" "( ͡°( ͡° ͜ʖ( ͡° ͜ʖ ͡°)ʖ ͡°) ͡°)" "	／人◕ ‿‿ ◕人＼" "_(:3」∠)_"
  "	( ｀皿´)｡ﾐ/" "(づ｡◕‿‿◕｡)づ" "٩( ๑╹ ꇴ╹)۶" "	༼つಠ益ಠ༽つ ─=≡ΣO))" "୧༼ಠ益ಠ╭∩╮༽" "	(╯°□°)╯︵ ┻━┻ ︵ ╯(°□° ╯)"
  "(ღ˘⌣˘ღ)" "─=≡Σ((( つ◕ل͜◕)つ" "(｡◕‿‿◕｡)" "(•_•) ( •_•)>⌐■-■ (⌐■_■)" "c[_]" "(=ↀωↀ=)" "┬┴┬┴┤(･_├┬┴┬┴")
while true; do
  if  [ $(date +%M) -eq 00 ] || [ $(date +%M) -eq 30 ]; then
    dunstify  -t 10000 "    OLHA A HORA: $(date +%H:%M)
    ${emojis[$RANDOM % ${#emojis[@]}]}"
    for i in {1..3}; do
      play -q ~/scripts/sounds/alarm-game-wave.wav gain -40
    done
  fi 
  sleep 60
done
# date | awk '{print $5}' | sed "s/:/ /g" | awk '{print $2}'
